#5) თქვენი სიტყვებით ახსენით, პითონში მონაცემები რამდენ ნაწილად იყოფა, თითოეული როდის გვხვდება და სად ვიყენებთ. ასევე გააკეთეთ paint-ში ნახაზი ამ ინფორმაციის შესახებ (მე როგორც ვხაზავ, შეგიძლიათ მსგავსად დახაზოთ)

#პითონში მონაცემები იყოფა 4 ნაწილად.
#ტექსტურ ინფორმაციას გვხვდება როცა ჩვენ ვწერთ რაიმე ტექსტს.
#რიცხვები გვხვდება მათემატიკური მოქმედების შესრულების დროს.
#მთელი რიცხვები გვხვდება როცა ჩვენ ვქმნით ცვლადს.
#ათწილადები გვხვდება როცა რიცხვებს ვამრავლებთ, ვყობთ, ვუმატებთ და ვაკლებთ.

#6) თქვენი სიტყვებით ახსენით რა განსხვავებაა /-სა და %-ს (გაყოფასა და ნაშთიან გაყოფას) შორის

#/-სა და %-ს შორის ის განსხვავებაა რომ გაყოფისას ტერმინალში ზუსტი პასუხი გამოაქ და ნაშთიანი გაყოფისას ტერმინალში სუსტი ნაშთი გამოაქ.

#7) მოცემულ ექვს ოპერატორზე: +, -, *, /, %, **   ჩამოწერეთ 3-3 მაგალითი

print(54 + 43)
print(12 + 67)
print(34 + 90)

print(65 - 43)
print(32 - 12)
print(65 - 56)

print(9 * 90)
print(124 * 54)
print(456 * 45)

print(23 / 7)
print(36 / 9)
print(128 / 2)

print(547 % 54)
print(634 % 34)
print(754 % 76)

print(12 ** 56)
print(65 ** 3)
print(312 ** 6)

#8) შექმენით ცვლადი სახელად celsius სადაც შეინახავთ მთელ რიცხვს შემდეგ შექმენით ცვლადი სახელად fahrenheit, სადაც უნდა გამოთვალოთ წინა ცვლადის ტემპერატურა ფარენჰეიტში რამდენი იქნება

celcius = 52
fahrenheit = 700

(0 * 9/5) + 700

#9) შექმენით თქვენი ოჯახის წევრების ასაკებისგან ცვლადები, დააფდეითეთ მათი მნიშვნელობები ახალ ცვლადებში - დაუწერეთ 20 წლის შემდეგ რა იქნება და დაპრინტეთ ახალი ცვლადების მნიშვნელობები October 19, 2024

